# -*- coding: utf-8 -*-
"""
Created on Sun Jun  8 19:29:50 2025

@author: Dmytro Nikolaenko (nikodim74@gmail.com)
@user: ndn74

Юнікод-коди для виводу можна знайти тут: https://unicode.org/emoji/charts/full-emoji-list.html
"""
import random

"""Гра в вгадування.
Напишіть програму, яка генерує випадкове число від 1 до 10 і дозволяє користувачеві вгадати,
яке число було згенеровано. Результат повинен бути відправлений користувачеві за допомогою оператора print.
"""
print('Завдання 1')
secret = random.randint(1, 10)
guess = int(input("\u2753Вгадай число від 1 до 10: "))

if guess == secret:
    print("\U0001F389 Вітаю! Ви вгадали число!")
else:
    print(f"\u274C Неправильно. Загадане число було: {secret}")

"""
Програма привітання з днем народження.
Напишіть програму, яка приймає ваше ім'я як вхідні дані, а потім ваш вік як вхідні дані і вітає вас наступним чином:
«Привіт, <ім'я>, на наступний день народження тобі виповниться <вік+1> років»
"""
print('\nЗавдання 2')
name = input("Введіть ваше ім'я: ")
age = int(input("Скільки вам років? "))

print(f"Привіт, {name}, на наступний день народження тобі виповниться {age + 1} років")


"""
Створіть програму, яка зчитує вхідний рядок, а потім створює і виводить 5 випадкових рядків із символів вхідного рядка.
Наприклад, програма отримала слово «hello», тому вона повинна вивести 5 випадкових рядків (слів),
які комбінують символи
«h», «e», «l», «l», «o» -> «hlelo», «olelh», «loleh» …
Поради: Використовуйте модуль random, щоб отримати випадковий символ із рядка.
"""
print('\nЗавдання 3')

# Зчитує рядок з клавіатури.
text = input("Введіть рядок: ")

# Генерується 5 випадкових рядків з тією ж довжиною, що й вхідний.
for _ in range(5):
    result = ''.join(random.choice(text) for _ in range(len(text)))
    """
    - random.choice(input_str) вибирає випадковий символ з рядка.
    - ''.join(...) об’єднує символи у новий рядок.
    """
    print(result)
