# -*- coding: utf-8 -*-
"""
Created on: 23.06.25 18:43
@author: Dmytro Nikolaenko (nikodim74@gmail.com)
@user: d.nikolaenko
@project name: Python3_dev_courses
@file: homework1.py
"""

"""
Task 1

Напишіть простий скрипт, який створює новий вихідний файл з назвою myfile.txt і записує
у нього рядок "Hello file world!". Потім напишіть ще один скрипт, який відкриває файл myfile.txt,
читає і виводить його вміст. Запустіть обидва скрипти з системного командного рядка.

 - Чи з'явився новий файл у каталозі, де ви запускали скрипти?
 - Що, якщо ви додасте інший шлях до каталогу до імені файлу, який передається для відкриття?

Зауважте: методи запису у файл не додають символів переходу на новий рядок до ваших рядків;
якщо ви хочете повністю завершити рядок у файлі, додайте у кінці рядка явний символ "\n".
"""

# Відкриваємо файл для запису (створиться новий, якщо не існує)

with open('myfile.txt', 'w') as file:
    file.write("Hello file world!\n" * 3)  # Додаємо \n для переходу на новий рядок
    print("Файл myfile.txt створено та заповнено текстом 'Hello file world!' тричі")

# Чи з'явився новий файл у каталозі, де ви запускали скрипти?
# Так, після виконання першого скрипта у тому самому каталозі, звідки запускався скрипт, з'явиться новий файл myfile.txt.

# Що, якщо ви додасте інший шлях до каталогу до імені файлу, який передається для відкриття?
# Якщо вказати шлях до іншого каталогу (наприклад, subfolder/myfile.txt або C:/path/to/file.txt у Windows),
# то файл створиться або буде прочитаний з вказаного місця.

